; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v7 ?v10)
             (pred_4 ?v4 ?v6)
             (pred_6 ?v7 ?v6)
             (pred_2 ?v9 ?v7 )
	     (pred_12 ?v7)
             (pred_10 ?v2)
             (pred_1 ?v4)
             (pred_5 ?v6)
             (pred_8 ?v7)
             (pred_11 ?v4)
             (pred_3 ?v7)
             (pred_9 ))



(:action op_4
:parameters (?v1 ?v13 ?v5 ?v8)
:precondition (and (pred_10 ?v1) (pred_10 ?v13) (pred_1 ?v5) (pred_5 ?v8)
          (pred_7 ?v1 ?v13) (pred_4 ?v5 ?v8)
                   (pred_6 ?v13 ?v8) (pred_12 ?v1) 
                   (pred_8 ?v13) (pred_11 ?v5))
:effect (and  (pred_3 ?v13) (not (pred_8 ?v13))))


(:action op_3
:parameters (?v1 ?v3)
:precondition (and (pred_10 ?v1) (pred_10 ?v3)
               (pred_12 ?v1) (pred_7 ?v1 ?v3) (pred_3 ?v3))
:effect (and (pred_12 ?v3) (not (pred_12 ?v1))))

(:action op_1
:parameters (?v1 ?v5)
:precondition (and (pred_10 ?v1) (pred_1 ?v5) 
                  (pred_12 ?v1) (pred_2 ?v5 ?v1) (pred_9 ))
:effect (and (pred_11 ?v5)
   (not (pred_2 ?v5 ?v1)) (not (pred_9 ))))


(:action op_5
:parameters (?v1 ?v11 ?v12)
:precondition (and (pred_10 ?v1) (pred_1 ?v11) (pred_1 ?v12)
                  (pred_12 ?v1) (pred_11 ?v12) (pred_2 ?v11 ?v1))
:effect (and (pred_11 ?v11) (pred_2 ?v12 ?v1)
        (not (pred_11 ?v12)) (not (pred_2 ?v11 ?v1))))

(:action op_2
:parameters (?v1 ?v5)
:precondition (and (pred_10 ?v1) (pred_1 ?v5) 
                  (pred_12 ?v1) (pred_11 ?v5))
:effect (and (pred_9 ) (pred_2 ?v5 ?v1) (not (pred_11 ?v5)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_13 obj_04 obj_03 obj_14 obj_09 obj_05 obj_08 obj_12 obj_02 obj_11 obj_06 obj_21 obj_17 obj_07 obj_10 obj_16
    obj_01 obj_19 obj_15
    obj_20 obj_22 obj_18
    )

    (:init
       (pred_9)

       (pred_10 obj_13)
       (pred_10 obj_04)
       (pred_10 obj_03)
       (pred_10 obj_14)
       (pred_10 obj_09)
       (pred_10 obj_05)
       (pred_10 obj_08)
       (pred_10 obj_12)
       (pred_10 obj_02)
       (pred_10 obj_11)
       (pred_10 obj_06)
       (pred_10 obj_21)
       (pred_10 obj_17)
       (pred_10 obj_07)
       (pred_10 obj_10)
       (pred_10 obj_16)
       (pred_5 obj_01)
       (pred_5 obj_19)
       (pred_5 obj_15)
       (pred_1 obj_20)
       (pred_1 obj_22)
       (pred_1 obj_18)

       (pred_7 obj_13 obj_09)
       (pred_7 obj_13 obj_04)
       (pred_7 obj_04 obj_05)
       (pred_7 obj_04 obj_03)
       (pred_7 obj_04 obj_13)
       (pred_7 obj_03 obj_08)
       (pred_7 obj_03 obj_14)
       (pred_7 obj_03 obj_04)
       (pred_7 obj_14 obj_12)
       (pred_7 obj_14 obj_03)
       (pred_7 obj_09 obj_02)
       (pred_7 obj_09 obj_05)
       (pred_7 obj_09 obj_13)
       (pred_7 obj_05 obj_11)
       (pred_7 obj_05 obj_08)
       (pred_7 obj_05 obj_04)
       (pred_7 obj_05 obj_09)
       (pred_7 obj_08 obj_06)
       (pred_7 obj_08 obj_12)
       (pred_7 obj_08 obj_03)
       (pred_7 obj_08 obj_05)
       (pred_7 obj_12 obj_21)
       (pred_7 obj_12 obj_14)
       (pred_7 obj_12 obj_08)
       (pred_7 obj_02 obj_17)
       (pred_7 obj_02 obj_11)
       (pred_7 obj_02 obj_09)
       (pred_7 obj_11 obj_07)
       (pred_7 obj_11 obj_06)
       (pred_7 obj_11 obj_05)
       (pred_7 obj_11 obj_02)
       (pred_7 obj_06 obj_10)
       (pred_7 obj_06 obj_21)
       (pred_7 obj_06 obj_08)
       (pred_7 obj_06 obj_11)
       (pred_7 obj_21 obj_16)
       (pred_7 obj_21 obj_12)
       (pred_7 obj_21 obj_06)
       (pred_7 obj_17 obj_07)
       (pred_7 obj_17 obj_02)
       (pred_7 obj_07 obj_10)
       (pred_7 obj_07 obj_11)
       (pred_7 obj_07 obj_17)
       (pred_7 obj_10 obj_16)
       (pred_7 obj_10 obj_06)
       (pred_7 obj_10 obj_07)
       (pred_7 obj_16 obj_21)
       (pred_7 obj_16 obj_10)
       (pred_8 obj_16)
       (pred_8 obj_12)
       (pred_8 obj_21)
       (pred_6  obj_16 obj_01)
       (pred_6  obj_12 obj_19)
       (pred_6  obj_21 obj_15)
       (pred_3 obj_13)
       (pred_3 obj_04)
       (pred_3 obj_03)
       (pred_3 obj_14)
       (pred_3 obj_09)
       (pred_3 obj_05)
       (pred_3 obj_08)
       (pred_3 obj_02)
       (pred_3 obj_11)
       (pred_3 obj_06)
       (pred_3 obj_17)
       (pred_3 obj_07)
       (pred_3 obj_10)

       (pred_4  obj_20 obj_01)
       (pred_4  obj_22 obj_19)
       (pred_4  obj_18 obj_15)
       (pred_2 obj_20 obj_09)
       (pred_2 obj_22 obj_13)
       (pred_2 obj_18 obj_08)
       (pred_12 obj_17)
    )

    (:goal (and
       (pred_2 obj_22 obj_11)
    ))
(:constraints
  (always (not (pred_12 obj_05)))
)
)

; plan
1. (op_3 obj_17 obj_02)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_02)
   goals met: 0 of 1
2. (op_3 obj_02 obj_09)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_09)
   goals met: 0 of 1
3. (op_3 obj_09 obj_13)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_13)
   goals met: 0 of 1
4. (op_1 obj_13 obj_22)
   deleted: (pred_2 obj_22 obj_13) (pred_9)
   added: (pred_11 obj_22)
   goals met: 0 of 1
5. (op_3 obj_13 obj_09)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_09)
   goals met: 0 of 1
6. (op_3 obj_09 obj_02)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_02)
   goals met: 0 of 1
7. (op_3 obj_02 obj_11)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_11)
   goals met: 0 of 1
8. (op_2 obj_11 obj_22)
   deleted: (pred_11 obj_22)
   added: (pred_9) (pred_2 obj_22 obj_11)
   goals met: 1 of 1
